Repository: FSoft-AI4Code/HyperAgent
Catalog: src/hyperagent/multilspy/language_servers/eclipse_jdtls/static/intellicode/extension/loc/xliff/*/vsintellicode.xlf
Languages: cs, de, es, fr, hu, it, ja, ko, nl, pl, pt_br, pt_pt, ru, sv, tr, zh_hans, zh_hant

# feature.apiExamplests.markdown
source: Promotes IntelliCode API Usage Examples extension to vscode intellicode typescript/javascript users.
cs: Propaguje rozšíření Příklady použití rozhraní API IntelliCode u uživatelů vscode intellicode typescript/javascript.
de: Hiermit wird die Erweiterung „IntelliCode-API-Verwendungsbeispiele“ gegenüber vscode-IntelliCode-TypeScript/JavaScript-Benutzern beworben.
es: Promueve la extensión de ejemplos de uso de la API de IntelliCode para los usuarios de Typescript/Javascript de IntelliCode.
fr: Promotion de l'extension IntelliCode API Usage Examples auprès des utilisateurs de vscode intellicode typescript/javascript
hu: Előlépteti az IntelliCode API-használati példák bővítményt a Vscode Intellicode Typescript/Javascript felhasználói számára.
it: Promuove l'estensione Esempi di utilizzo dell'API IntelliCode per gli utenti JavaScript/TypeScript VSCode IntelliCode.
ja: IntelliCode API Usage Examples 拡張機能を Vscode Intellicode TypeScript/JavaScript ユーザーに昇格させます。
ko: IntelliCode API 사용 예제 확장을 vscode intellicode typescript/javascript 사용자로 승격합니다.
nl: Bevordert de IntelliCode API Usage Examples-extensie voor vscode intellicode typescript/javascript-gebruikers.
pl: Podwyższa poziom rozszerzenia Przykłady użycia interfejsu API funkcji IntelliCode dla użytkowników funkcji IntelliCode w programie Visual Studio Code ze wsparciem języka TypeScript/JavaScript.
pt_br: Promove a extensão Exemplos de Uso da API do IntelliCode para usuários do vscode intellicode typescript/javascript.
pt_pt: Promove a extensão Exemplos de Utilização da API IntelliCode para utilizadores de typescript/javascript do vscode.
ru: Повышение уровня расширения с примерами использования API IntelliCode до пользователей TypeScript/JavaScript Intellicode Vscode.
sv: Erbjuder vscode intellicode typescript/javascript-användare tillägget IntelliCode API-användningsexempel.
tr: Vscode intellicode Typescript/Javascript kullanıcılarına IntelliCode API Kullanım Örnekleri uzantısını tanıtır.
zh_hans: 将 IntelliCode API 使用示例扩展提升为 vscode intellicode typescript/javascript 用户。
zh_hant: 將 IntelliCode API 使用方式範例延伸模組推廣至 VS Code IntelliCode TypeScript/JavaScript 使用者。

# sqlErrorMessage
source: Sorry, something went wrong activating IntelliCode support for SQL. Please check the "MSSQL" and "VS IntelliCode" output windows for details.
cs: Je nám líto, ale při aktivaci podpory IntelliCode pro SQL jsme narazili na chybu. Podrobnosti najdete v oknech výstupu MSSQL a VS IntelliCode.
de: Beim Aktivieren der IntelliCode-Unterstützung für SQL ist leider ein Problem aufgetreten. Weitere Informationen finden Sie in den Ausgabefenstern "MSSQL" und "VS IntelliCode".
es: Se ha producido un error al activar la compatibilidad de IntelliCode con SQL. Compruebe las ventanas de salida "MSSQL" y "VS IntelliCode" para obtener más detalles.
fr: Un problème s'est produit durant l'activation de la prise en charge d'IntelliCode pour SQL. Pour plus d'informations, consultez les fenêtres Sortie relatives à MSSQL et à VS IntelliCode.
hu: Sajnáljuk, hiba történt az SQL IntelliCode-támogatásának aktiválása során. A részletekért tekintse meg a „MSSQL“ és a „VS IntelliCode“ kimeneti ablakot.
it: Si è verificato un errore durante l'attivazione del supporto IntelliCode per SQL. Per dettagli, vedere le finestre di output di "MSSQL" e "VS IntelliCode".
ja: 申し訳ございません。SQL の IntelliCode サポートのアクティブ化で問題が発生しました。詳細については、"MSSQL" および "VS IntelliCode" の出力ウィンドウをご確認ください。
ko: 죄송합니다. SQL용 IntelliCode 지원을 활성화하는 동안 문제가 발생했습니다. 자세한 내용은 "MSSQL" 및 "VS IntelliCode" 출력 창을 확인하세요.
nl: Sorry, er is iets misgegaan bij het activeren van IntelliCode-ondersteuning voor SQL. Controleer de "MSSQL"- en "VS IntelliCode"-uitvoervensters voor details.
pl: Niestety, wystąpił błąd podczas aktywowania obsługi funkcji IntelliCode dla języka SQL. Szczegóły znajdziesz w oknach danych wyjściowych „MSSQL„ i „VS IntelliCode”.
pt_br: Houve um erro ao ativar o suporte do IntelliCode para SQL. Verifique as janelas de saída "MSSQL" e "VS IntelliCode" para obter detalhes.
pt_pt: Lamentamos, mas algo correu mal ao ativar o suporte do IntelliCode para SQL. Verifique as janelas de saída "MSSQL" e " VS IntelliCode" para obter detalhes.
ru: К сожалению, при включении поддержки IntelliCode для SQL возникла ошибка. Сведения см. в окнах вывода "MSSQL" и "VS IntelliCode".
sv: Något gick fel när IntelliCode-stöd för SQL aktiverades. Mer information finns i utdatafönstren "MSSQL" och "VS IntelliCode".
tr: Ne yazık ki SQL için IntelliCode desteği etkinleştirilirken bir sorun oluştu. Ayrıntılar için lütfen "MSSQL" ve "VS IntelliCode" çıkış pencerelerini kontrol edin.
zh_hans: 很抱歉，激活面向 SQL 的 IntelliCode 支持时遇到问题。有关详细信息，请查看 "MSSQL" 和 "VS IntelliCode" 输出窗口。
zh_hant: 抱歉，啟用適用於 SQL的 IntelliCode 支援時發生錯誤。如需詳細資料，請查看 [MSSQL] 和 [VS IntelliCode] 輸出視窗。

# typescriptErrorMessage
source: Sorry, something went wrong activating IntelliCode support for TypeScript/JavaScript. Please check the "VS IntelliCode" output window for details.
cs: Je nám líto, ale při aktivaci podpory IntelliCode pro TypeScript/JavaScript jsme narazili na chybu. Podrobnosti najdete v okně výstupu VS IntelliCode.
de: Beim Aktivieren der IntelliCode-Unterstützung für TypeScript/JavaScript ist leider ein Problem aufgetreten. Weitere Informationen finden Sie im Ausgabefenster "VS IntelliCode".
es: Se ha producido un error al activar la compatibilidad de IntelliCode con TypeScript/JavaScript. Compruebe la ventana de salida "VS IntelliCode" para obtener más detalles.
fr: Un problème s'est produit durant l'activation de la prise en charge d'IntelliCode pour TypeScript/JavaScript. Pour plus d'informations, consultez la fenêtre Sortie relative à VS IntelliCode.
hu: Sajnáljuk, hiba történt a TypeScript/JavaScript IntelliCode-támogatásának aktiválása során. A részletekért tekintse meg a „VS IntelliCode“ kimeneti ablakot.
it: Si è verificato un errore durante l'attivazione del supporto IntelliCode per TypeScript/JavaScript. Per dettagli, vedere la finestra di output di Visual Studio IntelliCode.
ja: 申し訳ございません。TypeScript/JavaScript の IntelliCode サポートのアクティブ化で問題が発生しました。詳細については、"VS IntelliCode" 出力ウィンドウをご確認ください。
ko: 죄송합니다. TypeScript/JavaScript용 IntelliCode 지원을 활성화하는 동안 문제가 발생했습니다. 자세한 내용은 "VS IntelliCode" 출력 창을 확인하세요.
nl: Sorry, er is iets misgegaan bij het activeren van IntelliCode-ondersteuning voor TypeScript/JavaScript. Controleer het "VS IntelliCode"- uitvoervenster voor details.
pl: Niestety, wystąpił błąd podczas aktywowania obsługi funkcji IntelliCode dla języka TypeScript/JavaScript. Szczegóły znajdziesz w oknie danych wyjściowych „VS IntelliCode”.
pt_br: Houve um erro ao ativar o suporte do IntelliCode para TypeScript/JavaScript. Verifique a janela de saída "VS IntelliCode" para obter detalhes.
pt_pt: Lamentamos, mas algo correu mal ao ativar o suporte do IntelliCode para TypeScript/JavaScript. Verifique a janela de saída "VS IntelliCode" para obter detalhes.
ru: К сожалению, при включении поддержки IntelliCode для TypeScript/JavaScript возникла ошибка. Дополнительные сведения см. в окне вывода "Visual Studio IntelliCode".
sv: Något gick fel när IntelliCode-stöd för TypeScript/JavaScript aktiverades. Mer information finns i utdatafönstret "VS IntelliCode".
tr: Ne yazık ki TypeScript/JavaScript için IntelliCode desteği etkinleştirilirken bir sorun oluştu. Ayrıntılar için lütfen "VS IntelliCode" çıkış penceresini kontrol edin.
zh_hans: 很抱歉，激活面向 TypeScript/JavaScript 的 IntelliCode 支持时遇到问题。有关详细信息，请查看 "VS IntelliCode" 输出窗口。
zh_hant: 抱歉，啟用適用於 TypeScript/JavaScript 的 IntelliCode 支援時發生錯誤。如需詳細資料，請查看和 [VS IntelliCode] 輸出視窗。

# javaErrorMessage
source: Sorry, something went wrong activating IntelliCode support for Java. Please check the "Language Support for Java" and "VS IntelliCode" output windows for details.
cs: Je nám líto, ale při aktivaci podpory IntelliCode pro Javu jsme narazili na chybu. Další podrobnosti najdete v oknech výstupu jazykové podpory pro Javu a VS IntelliCode.
de: Beim Aktivieren der IntelliCode-Unterstützung für Java ist leider ein Problem aufgetreten. Weitere Informationen finden Sie in den Ausgabefenstern "Sprachunterstützung für Java" und "VS IntelliCode".
es: Se ha producido un error al activar la compatibilidad de IntelliCode con Java. Para más información, consulte las ventanas de salida "Compatibilidad de lenguaje con Java" y "VS IntelliCode".
fr: Un problème s'est produit durant l'activation de la prise en charge d'IntelliCode pour Java. Pour plus d'informations, consultez les fenêtres Sortie relatives à la prise en charge du langage pour Java et à VS IntelliCode.
hu: Sajnáljuk, hiba történt a Java IntelliCode-támogatásának aktiválása során. A részletekért tekintse meg a „Nyelvi támogatás Javához“ és a „VS IntelliCode“ kimeneti ablakot.
it: Si è verificato un errore durante l'attivazione del supporto IntelliCode per Java. Per dettagli, vedere le finestre di output del supporto del linguaggio per Java e di Visual Studio IntelliCode.
ja: 申し訳ございません。Java の IntelliCode サポートのアクティブ化で問題が発生しました。詳細については、"Java の言語サポート" および "VS IntelliCode" の出力ウィンドウをご確認ください。
ko: 죄송합니다. Java용 IntelliCode 지원을 활성화하는 동안 문제가 발생했습니다. 자세한 내용은 "Java용 언어 지원" 및 "VS IntelliCode" 출력 창을 확인하세요.
nl: Sorry, er is iets misgegaan bij het activeren van IntelliCode-ondersteuning voor Java. Controleer de "Taalondersteuning voor Java"- en "VS IntelliCode"-uitvoervensters voor details.
pl: Niestety, wystąpił błąd podczas aktywowania obsługi funkcji IntelliCode dla języka Java. Szczegóły znajdziesz w oknach danych wyjściowych „Obsługa języka dla języka Java„ i „VS IntelliCode”.
pt_br: Houve um erro ao ativar o suporte do IntelliCode para Java. Verifique as janelas de saída de "Suporte à Linguagem para Java" e "VS IntelliCode" para obter detalhes.
pt_pt: Lamentamos, mas algo correu mal ao ativar o suporte do IntelliCode para Java. Verifique as janelas de saída "Suporte de Linguagem para Java" e " VS IntelliCode" para obter detalhes.
ru: К сожалению, при включении поддержки IntelliCode для Java возникла ошибка. Дополнительные сведения см. в окнах вывода "Поддержка языка Java" и "Visual Studio IntelliCode".
sv: Något gick fel när IntelliCode-stöd för Java aktiverades. Mer information finns i utdatafönstren "Språkstöd för Java" och "VS IntelliCode".
tr: Ne yazık ki Java için IntelliCode desteği etkinleştirilirken bir sorun oluştu. Ayrıntılar için lütfen "Java Dil Desteği" ve "VS IntelliCode" çıkış pencerelerini kontrol edin.
zh_hans: 很抱歉，激活面向 Java 的 IntelliCode 支持时遇到问题。有关详细信息，请查看“针对 Java 的语言支持”和 "VS IntelliCode" 输出窗口。
zh_hant: 抱歉，啟用適用於 Java 的 IntelliCode 支援時發生錯誤。如需詳細資料，請查看 [Language Support for Java] 和 [VS IntelliCode] 輸出視窗。

# pythonErrorMessage
source: Sorry, something went wrong activating IntelliCode support for Python. Please check the "Python" and "VS IntelliCode" output windows for details.
cs: Je nám líto, ale při aktivaci podpory IntelliCode pro Python jsme narazili na chybu. Podrobnosti najdete v oknech výstupu Pythonu a VS IntelliCode.
de: Beim Aktivieren der IntelliCode-Unterstützung für Python ist leider ein Problem aufgetreten. Weitere Informationen finden Sie in den Ausgabefenstern "Python" und "VS IntelliCode".
es: Se ha producido un error al activar la compatibilidad de IntelliCode con Python. Compruebe las ventanas de salida "Python" y "VS IntelliCode" para obtener más detalles.
fr: Un problème s'est produit durant l'activation de la prise en charge d'IntelliCode pour Python. Pour plus d'informations, consultez les fenêtres Sortie relatives à Python et à VS IntelliCode.
hu: Sajnáljuk, hiba történt a Python IntelliCode-támogatásának aktiválása során. A részletekért tekintse meg a „Python“ és a „VS IntelliCode“ kimeneti ablakot.
it: Si è verificato un errore durante l'attivazione del supporto IntelliCode per Python. Per dettagli, vedere le finestre di output di Python e di Visual Studio IntelliCode.
ja: 申し訳ございません。Python の IntelliCode サポートのアクティブ化で問題が発生しました。詳細については、"Python" および "VS IntelliCode" の出力ウィンドウをご確認ください。
ko: 죄송합니다. Python용 IntelliCode 지원을 활성화하는 동안 문제가 발생했습니다. 자세한 내용은 "Python" 및 "VS IntelliCode" 출력 창을 확인하세요.
nl: Sorry, er is iets misgegaan bij het activeren van IntelliCode-ondersteuning voor Python. Controleer de "Python"- en "VS IntelliCode"-uitvoervensters voor details.
pl: Niestety, wystąpił błąd podczas aktywowania obsługi funkcji IntelliCode dla języka Python. Szczegóły znajdziesz w oknach danych wyjściowych „Python„ i „VS IntelliCode”.
pt_br: Houve um erro ao ativar o suporte do IntelliCode para Python. Verifique as janelas de saída "Python" e "VS IntelliCode" para obter detalhes.
pt_pt: Lamentamos, mas algo correu mal ao ativar o suporte do IntelliCode para Python. Verifique as janelas de saída do "Python" e "VS IntelliCode" para obter detalhes.
ru: К сожалению, при включении поддержки IntelliCode для Python возникла ошибка. Дополнительные сведения см. в окнах вывода "Python" и "Visual Studio IntelliCode".
sv: Något gick fel när IntelliCode-stöd för Python aktiverades. Mer information finns i utdatafönstren "Python" och "VS IntelliCode".
tr: Ne yazık ki Python için IntelliCode desteği etkinleştirilirken bir sorun oluştu. Ayrıntılar için lütfen "Python" ve "VS IntelliCode" çıkış pencerelerini kontrol edin.
zh_hans: 很抱歉，激活面向 Java 的 IntelliCode 支持时遇到问题。有关详细信息，请查看 "Python" 和 "VS IntelliCode" 输出窗口。
zh_hant: 抱歉，啟用適用於 Python 的 IntelliCode 支援時發生錯誤。如需詳細資料，請查看 [Python] 和 [VS IntelliCode] 輸出視窗。

# missingExtensionMessage
source: You can install the {0} extension to get an enhanced completion experience with IntelliCode
cs: Můžete si nainstalovat rozšíření {0}, abyste měli k dispozici vylepšené doplňování položek kódu pomocí IntelliCode.
de: Sie können die {0}-Erweiterung installieren, um mit IntelliCode von einer verbesserten Vervollständigung zu profitieren.
es: Puede instalar la extensión {0} para obtener una experiencia de finalización mejorada con IntelliCode.
fr: Vous pouvez installer l'extension {0} pour obtenir une amélioration de la complétion avec IntelliCode
hu: Telepítheti a(z) {0} bővítményt, hogy bővített befejezési élményt kapjon az IntelliCode által
it: Per accedere a un'esperienza di completamento avanzata con IntelliCode, è possibile installare l'estensione {0}
ja: {0} 拡張機能をインストールして、IntelliCode での強化された入力候補エクスペリエンスを利用できます
ko: {0} 확장을 설치하여 IntelliCode에서 향상된 완성 환경을 얻을 수 있습니다.
nl: U kunt de {0}-extensie installeren om een verbeterde voltooiingservaring te krijgen met IntelliCode
pl: Możesz zainstalować rozszerzenie {0}, aby uzyskać ulepszone uzupełnianie przy użyciu funkcji IntelliCode
pt_br: Você pode instalar a extensão {0} para obter uma experiência de conclusão aprimorada com o IntelliCode
pt_pt: Pode instalar a extensão {0} para obter uma experiência de conclusão melhorada com o IntelliCode
ru: Вы можете установить расширение {0} для улучшенного автозавершения в IntelliCode.
sv: Du kan installera tillägget {0} för att få en förbättrad slutförandeupplevelse med IntelliCode
tr: IntelliCode ile gelişmiş tamamlama deneyiminden yararlanmak için {0} uzantısını yükleyebilirsiniz
zh_hans: 可安装 {0} 扩展，通过 IntelliCode 获取增强的完成体验
zh_hant: 您可以安裝 {0} 延伸模組，來獲得更強的 IntelliCode 完成體驗

# outOfDateExtensionMessage
source: Please update the {0} extension to get an enhanced completion experience with IntelliCode. IntelliCode requires version {1} or newer.
cs: Pokud chcete mít k dispozici vylepšené doplňování položek kódu pomocí IntelliCode, aktualizujte si prosím rozšíření {0}. IntelliCode vyžaduje verzi {1} nebo novější.
de: Aktualisieren Sie die {0}-Erweiterung, um mit IntelliCode von einer verbesserten Vervollständigung zu profitieren. Für IntelliCode wird Version {1} oder höher benötigt.
es: Actualice la extensión {0} para obtener una experiencia de finalización mejorada con IntelliCode. IntelliCode requiere la versión {1} o posterior.
fr: Mettez à jour l'extension {0} pour obtenir une amélioration de la complétion avec IntelliCode. IntelliCode nécessite la version {1} ou une version ultérieure.
hu: Frissítse a(z) {0} bővítményt, hogy bővített befejezési élményt kapjon az IntelliCode által. Az IntelliCode {1} vagy újabb verziót igényel.
it: Per accedere a un'esperienza di completamento avanzata con IntelliCode, aggiornare l'estensione {0}. IntelliCode richiede la versione {1} o successiva.
ja: IntelliCode での強化された入力候補エクスペリエンスを利用するには、{0} の拡張機能を更新してください。 IntelliCode にはバージョン {1} 以降が必要です。
ko: {0} 확장을 업데이트하여 IntelliCode에서 향상된 완성 환경을 얻으세요. IntelliCode는 {1} 이상 버전이 필요합니다.
nl: Werk de {0}-extensie bij om een verbeterde voltooiingservaring met IntelliCode te krijgen. Voor IntelliCode is versie {1} of nieuwere versie vereist.
pl: Zaktualizuj rozszerzenie {0}, aby uzyskać ulepszone uzupełnianie za pomocą funkcji IntelliCode. Funkcja IntelliCode wymaga wersji {1} lub nowszej.
pt_br: Atualize a extensão {0} para obter uma experiência de conclusão aprimorada com o IntelliCode. O IntelliCode exige a versão {1} ou mais recente.
pt_pt: Atualize a extensão {0} para obter uma experiência de conclusão melhorada com IntelliCode. IntelliCode requer a versão {1} ou mais recente.
ru: Обновите расширение {0} для улучшенного автозавершения в IntelliCode. IntelliCode требует как минимум версии {1}.
sv: Uppdatera tillägget {0} för att få en förbättrad slutförandeupplevelse med IntelliCode. IntelliCode kräver version {1} eller senare.
tr: IntelliCode ile gelişmiş bir tamamlama deneyiminden yararlanmak için lütfen {0} uzantısını güncelleştirin. IntelliCode {1} veya sonraki bir sürümünü gerektirir.
zh_hans: 请更新 {0} 扩展，通过 IntelliCode 获取增强的完成体验。 IntelliCode 需使用版本 {1} 或更高版本。
zh_hant: 請更新 {0} 延伸模組來取得更強的 IntelliCode 完成體驗。 IntelliCode 需要 {1} 版或更新版本。

source: View details
cs: Zobrazit podrobnosti
de: Details anzeigen
es: Ver detalles
fr: Afficher les détails
hu: Részletek megtekintése
it: Visualizza dettagli
ja: 詳細の表示
ko: 세부 정보 보기
nl: Details weergeven
pl: Wyświetl szczegóły
pt_br: Exibir detalhes
pt_pt: Ver detalhes
ru: Просмотреть сведения
sv: Visa information
tr: Ayrıntıları görüntüle
zh_hans: 查看详细信息
zh_hant: 檢視詳細資料

# downloadingStatusBarTitle
source: Downloading IntelliCode models
cs: Stahují se modely IntelliCode.
de: IntelliCode-Modelle werden heruntergeladen
es: Descargando los modelos de IntelliCode
fr: Téléchargement des modèles IntelliCode
hu: IntelliCode-modellek letöltése
it: Download dei modelli IntelliCode
ja: IntelliCode モデルをダウンロードしています
ko: IntelliCode 모델 다운로드 중
nl: IntelliCode-modellen downloaden
pl: Pobieranie modeli funkcji IntelliCode
pt_br: Baixando modelos do IntelliCode
pt_pt: A transferir modelos intelliCode
ru: Скачивание моделей IntelliCode
sv: Ladda ned IntelliCode-modeller
tr: IntelliCode modelleri indiriliyor
zh_hans: 正在下载 IntelliCode 模型
zh_hant: 正在下載 IntelliCode 模型

# downloadModelError
source: Couldn't download IntelliCode model. Please check your network connectivity or firewall settings.
cs: Nepovedlo se stáhnout model IntelliCode. Zkontrolujte si prosím připojení k síti nebo nastavení brány firewall.
de: Das IntelliCode-Modell konnte nicht heruntergeladen werden. Überprüfen Sie Ihre Netzwerkkonnektivität oder die Firewalleinstellungen.
es: No se ha podido descargar el modelo de IntelliCode. Compruebe la configuración del firewall o la conectividad de red.
fr: Impossible de télécharger le modèle IntelliCode. Vérifiez votre connectivité réseau ou vos paramètres de pare-feu.
hu: Nem sikerült letölteni az IntelliCode-modellt. Ellenőrizze a hálózati kapcsolatot vagy a tűzfalbeállításokat.
it: Non è stato possibile scaricare il modello IntelliCode. Verificare la connettività di rete o le impostazioni del firewall.
ja: IntelliCode モデルをダウンロードできませんでした。ネットワーク接続またはファイアウォールの設定を確認してください。
ko: IntelliCode 모델을 다운로드할 수 없습니다. 네트워크 연결 또는 방화벽 설정을 확인하세요.
nl: Kan het IntelliCode-model niet downloaden. Controleer de netwerkconnectiviteit of firewallinstellingen.
pl: Nie można pobrać modelu funkcji IntelliCode. Sprawdź łączność sieciową i ustawienia zapory.
pt_br: Não foi possível baixar o modelo do IntelliCode. Verifique as configurações de firewall ou a conectividade de rede.
pt_pt: Não foi possível transferir o modelo IntelliCode. Verifique a conectividade de rede ou as definições da firewall.
ru: Скачать модель IntelliCode не удалось. Проверьте подключение к сети и параметры брандмауэра.
sv: Det gick inte att ladda ned IntelliCode-modellen. Kontrollera nätverksanslutningen eller brandväggsinställningarna.
tr: IntelliCode modeli indirilemedi. Lütfen ağ bağlantınızı veya güvenlik duvarı ayarlarınızı denetleyin.
zh_hans: 无法下载 IntelliCode 模型。请检查网络连接或防火墙设置。
zh_hant: 無法下載 IntelliCode 模型。請檢查您的網路連線，或是防火牆設定。

# applySettingFailure
source: IntelliCode wasn't able to apply the user setting '{0}.{1}': '{2}' automatically, please manually set it.
cs: Pro IntelliCode se nepovedlo použít uživatelské nastavení {0}.{1}: {2} automaticky. Nastavte ho prosím ručně.
de: IntelliCode konnte die Benutzereinstellung "{0}.{1}": "{2}" nicht automatisch anwenden, legen Sie sie manuell fest.
es: IntelliCode no ha podido aplicar la configuración de usuario "{0}.{1}": "{2}" de forma automática. Establézcala manualmente.
fr: IntelliCode n'a pas pu appliquer le paramètre utilisateur '{0}.{1}' : '{2}' de manière automatique. Définissez-le manuellement.
hu: Az IntelliCode nem tudta alkalmazni a(z) „{0}.{1}“: „{2}“ felhasználói beállítást automatikusan. Kérjük, állítsa be manuálisan.
it: IntelliCode non è riuscito ad applicare automaticamente l'impostazione utente '{0}.{1}': '{2}'. Impostarla manualmente.
ja: IntelliCode はユーザー設定 '{0}.{1}': '{2}' を自動的に適用できませんでした。手動で設定してください。
ko: IntelliCode에서 사용자 설정 '{0}.{1}': '{2}'을(를) 자동으로 적용할 수 없습니다. 수동으로 설정하세요.
nl: IntelliCode kan de gebruikersinstelling {0}.{1} niet toepassen: {2} automatisch instellen.
pl: Funkcja IntelliCode nie mogła automatycznie zastosować ustawienia użytkownika „{0}.{1}”: „{2}”, ustaw je ręcznie.
pt_br: O IntelliCode não pôde aplicar a configuração do usuário '{0}.{1}': '{2}' automaticamente. Defina-a manualmente.
pt_pt: O IntelliCode não conseguiu aplicar a definição de utilizador "{0}.{1}": "{2}" automaticamente, defina-o manualmente.
ru: IntelliCode не удалось применить пользовательскую настройку "{0}.{1}": "{2}" автоматически. Задайте ее вручную.
sv: IntelliCode kunde inte tillämpa användarinställningen {0}.{1} : {2} konfigurerar du det manuellt.
tr: IntelliCode '{0}.{1}': '{2}' kullanıcı ayarını otomatik olarak uygulayamadı. Lütfen kendiniz ayarlayın.
zh_hans: IntelliCode 无法自动应用用户设置 "{0}.{1}": "{2}"，请手动设置它。
zh_hant: IntelliCode 無法自動套用使用者設定 '{0}.{1}': '{2}'，請手動予以設定。

# changeIncompatibleSetting
source: Yes
cs: Ano
de: Ja
es: Sí
fr: Oui
hu: Igen
it: Sì
ja: はい
ko: 예
nl: Ja
pl: Tak
pt_br: Sim
pt_pt: Sim
ru: Да
sv: Ja
tr: Evet
zh_hans: 是
zh_hant: 是

# dontChangeIncompatibleSetting
source: Don't ask again
cs: Příště se už neptat
de: Nicht erneut nachfragen
es: No volver a preguntar
fr: Ne plus demander
hu: Ne jelenjen meg újra ez a kérdés
it: Non chiedere più
ja: 今後このメッセージを表示しない
ko: 다시 묻지 않음
nl: Niet opnieuw vragen
pl: Nie pytaj ponownie
pt_br: Não perguntar novamente
pt_pt: Não voltar a perguntar
ru: Больше не спрашивать
sv: Fråga inte igen
tr: Tekrar sorma
zh_hans: 不再询问
zh_hant: 不要再詢問
