Repository: FSoft-AI4Code/HyperAgent
Catalog: src/hyperagent/multilspy/language_servers/eclipse_jdtls/static/intellicode/extension/loc/xliff/*/vsintellicode.xlf
Languages: cs, de, es, fr, hu, it, ja, ko, nl, pl, pt_br, pt_pt, ru, sv, tr, zh_hans, zh_hant

# extension.description
source: AI-assisted development
cs: Vývoj s asistencí AI
de: AI-gestützte Entwicklung
es: Desarrollo asistido por inteligencia artificial
fr: Développement assisté par l'IA
hu: AI által támogatott fejlesztés
it: Sviluppo con supporto per intelligenza artificiale
ja: AI 支援開発
ko: AI 지원 개발
nl: Door AI ondersteunde ontwikkeling
pl: Programowanie wspomagane przez sztuczną inteligencję
pt_br: Desenvolvimento assistido por IA
pt_pt: Desenvolvimento assistido por IA
ru: Разработка с помощью ИИ
sv: AI-assisterad utveckling
tr: Yapay zeka destekli geliştirme
zh_hans: AI 辅助开发
zh_hant: AI 輔助的開發

# setting.modelDownloadPath
source: Specifies the folder path where downloaded model files are stored. Defaults to the extension install directory if not specified.
cs: Určuje cestu ke složce, kde jsou uloženy soubory staženého modelu. Pokud nezadáte adresář, použije se výchozí instalační adresář rozšíření.
de: Gibt den Ordnerpfad an, in dem heruntergeladene Modelldateien gespeichert werden. Standardmäßig wird das Installationsverzeichnis für die Erweiterung verwendet, sofern nicht anders angegeben.
es: Especifica la ruta de acceso a la carpeta donde se almacenan los archivos de modelo descargados. Si no se especifica, el valor predeterminado es el directorio de instalación de la extensión.
fr: Spécifie le chemin de dossier où sont stockés les fichiers de modèles téléchargés. En l'absence d'indication, le répertoire d'installation de l'extension représente la valeur par défaut.
hu: Megadja a letöltött modellfájlok tárolására szolgáló mappa elérési útját. Alapértelmezés szerint a bővítmény telepítési könyvtára, ha nincs megadva.
it: Consente di specificare il percorso della cartella in cui vengono archiviati i file di modello scaricati. Se non è specificato, per impostazione predefinita viene usata la directory di installazione dell'estensione.
ja: ダウンロードしたモデル ファイルを格納するフォルダーのパスを指定します。指定しない場合、既定で拡張機能のインストール ディレクトリに設定されます。
ko: 다운로드한 모델 파일이 저장되는 폴더 경로를 지정합니다. 지정되지 않은 경우 기본값은 확장 설치 디렉터리입니다.
nl: Hiermee geeft u het mappad op waar gedownloade modelbestanden worden opgeslagen. De standaardinstelling voor de installatiemap van de extensie is niet opgegeven.
pl: Określa ścieżkę folderu do przechowywania pobranych plików modeli. Jeśli nie zostanie określona, domyślnie będzie to katalog instalacyjny rozszerzenia.
pt_br: Especifica o caminho da pasta em que os arquivos de modelo baixados são armazenados. O padrão é o diretório de instalação da extensão, se não especificado.
pt_pt: Especifica o caminho da pasta onde os ficheiros de modelo transferidos são armazenados. A predefinição é o diretório de instalação da extensão, se não for especificado.
ru: Указывает путь к папке, где хранятся скачанные файлы модели. Если он не задан, по умолчанию используется каталог установки расширения.
sv: Anger mappsökvägen där nedladdade modellfiler lagras. Standardvärdet är installationskatalogen för tillägget om inget anges.
tr: İndirilen model dosyalarının depolandığı klasör yolunu belirtir. Belirtilmemişse, varsayılan olarak uzantı yükleme dizini kullanılır.
zh_hans: 指定存储所下载的模型文件的文件夹路径。如果未指定，则默认为扩展安装目录。
zh_hant: 指定儲存所下載模型檔案的資料夾路徑。如果未指定，會預設為延伸模組安裝目錄。

# setting.pythonEnabled
source: Enable Visual Studio IntelliCode completions for Python
cs: Povolit doplňování položek kódu pomocí Visual Studio IntelliCode pro Python
de: Visual Studio IntelliCode-Vervollständigung für Python aktivieren
es: Habilitar las finalizaciones de Visual Studio IntelliCode para Python
fr: Activer les complétions Visual Studio IntelliCode pour Python
hu: Engedélyezze a Visual Studio IntelliCode-befejezéseket a Pythonhoz
it: Abilita completamenti di Visual Studio IntelliCode per Python
ja: Python の Visual Studio IntelliCode 入力候補を有効にする
ko: Python용 Visual Studio IntelliCode 완성 사용
nl: IntelliCode-voltooiingen voor Visual Studio inschakelen voor Python
pl: Włącz uzupełnianie przez funkcję Visual Studio IntelliCode dla języka Python
pt_br: Habilitar as conclusões de IntelliCode do Visual Studio para Python
pt_pt: Ativar as conclusão do Visual Studio IntelliCode para Python
ru: Включить автозавершение Visual Studio IntelliCode для Python
sv: Aktivera Visual Studio IntelliCode-slutföranden för Python
tr: Python için Visual Studio IntelliCode tamamlamalarını etkinleştir
zh_hans: 为 Python 启用 Visual Studio IntelliCode 完成功能
zh_hant: 啟用適用於 Python 的 Visual Studio IntelliCode 完成

# setting.javaEnabled
source: Enable Visual Studio IntelliCode completions for Java
cs: Povolit doplňování položek kódu pomocí Visual Studio IntelliCode pro Javu
de: Visual Studio IntelliCode-Vervollständigung für Java aktivieren
es: Habilitar las finalizaciones de Visual Studio IntelliCode para Java
fr: Activer les complétions Visual Studio IntelliCode pour Java
hu: Engedélyezze a Visual Studio IntelliCode-befejezéseket a Javához
it: Abilita completamenti di Visual Studio IntelliCode per Java
ja: Java の Visual Studio IntelliCode 入力候補を有効にする
ko: Java용 Visual Studio IntelliCode 완성 사용
nl: IntelliCode-voltooiingen voor Visual Studio inschakelen voor Java
pl: Włącz uzupełnianie przez funkcję Visual Studio IntelliCode dla języka Java
pt_br: Habilitar as conclusões de IntelliCode do Visual Studio para Java
pt_pt: Ativar as conclusão do Visual Studio IntelliCode para Java
ru: Включить автозавершение Visual Studio IntelliCode для Java
sv: Aktivera Visual Studio IntelliCode-slutföranden för Java
tr: Java için Visual Studio IntelliCode tamamlamalarını etkinleştir
zh_hans: 为 Java 启用 Visual Studio IntelliCode 完成功能
zh_hant: 啟用適用於 Java 的 Visual Studio IntelliCode 完成

# setting.typescriptEnabled
source: Enable Visual Studio IntelliCode completions for TypeScript and JavaScript
cs: Povolit doplňování položek kódu pomocí Visual Studio IntelliCode pro TypeScript a JavaScript
de: Visual Studio IntelliCode-Vervollständigung für TypeScript und JavaScript aktivieren
es: Habilitar las finalizaciones de Visual Studio IntelliCode para TypeScript y JavaScript
fr: Activer les complétions Visual Studio IntelliCode pour TypeScript et JavaScript
hu: Engedélyezze a Visual Studio IntelliCode-befejezéseket a TypeScripthez és a JavaScripthez
it: Abilita completamenti di Visual Studio IntelliCode per TypeScript e JavaScript
ja: TypeScript および JavaScript の Visual Studio IntelliCode 入力候補を有効にする
ko: TypeScript 및 JavaScript용 Visual Studio IntelliCode 완성 사용
nl: Voltooiingen van Visual Studio IntelliCode inschakelen voor TypeScript en JavaScript
pl: Włącz uzupełnianie przez funkcję Visual Studio IntelliCode dla języków TypeScript i JavaScript
pt_br: Habilitar as conclusões de IntelliCode do Visual Studio para TypeScript e JavaScript
pt_pt: Ativar as conclusão do Visual Studio IntelliCode para TypeScript e JavaScript
ru: Включить автозавершение Visual Studio IntelliCode для TypeScript и JavaScript
sv: Aktivera Visual Studio IntelliCode-slutföranden för TypeScript och JavaScript
tr: TypeScript ve JavaScript için Visual Studio IntelliCode tamamlamalarını etkinleştir
zh_hans: 为 TypeScript 和 JavaScript 启用 Visual Studio IntelliCode 完成功能
zh_hant: 啟用適用於 TypeScript 和 JavaScript 的 Visual Studio IntelliCode 完成

# setting.sqlEnabled
source: Enable Visual Studio IntelliCode completions for MSSQL
cs: Povolit doplňování položek kódu pomocí Visual Studio IntelliCode pro MSSQL
de: Visual Studio IntelliCode-Vervollständigung für MSSQL aktivieren
es: Habilitar la finalización de código de Visual Studio IntelliCode para MSSQL
fr: Activer les complétions Visual Studio IntelliCode pour MSSQL
hu: Engedélyezze a Visual Studio IntelliCode-befejezéseket az MSSQL-hez
it: Abilita completamenti di Visual Studio IntelliCode per MSSSQL
ja: MSSQL の Visual Studio IntelliCode 入力候補を有効にする
ko: MSSQL용 Visual Studio IntelliCode 완성 사용
nl: IntelliCode-voltooiingen voor Visual Studio inschakelen voor MSSQL
pl: Włącz uzupełnianie przez funkcję Visual Studio IntelliCode dla programu MSSQL
pt_br: Habilitar as conclusões do IntelliCode do Visual Studio para MSSQL
pt_pt: Ativar as conclusão do Visual Studio IntelliCode para MSSQL
ru: Включить автозавершение Visual Studio IntelliCode для MSSQL
sv: Aktivera Visual Studio IntelliCode-slutföranden för MSSQL
tr: MSSQL için Visual Studio IntelliCode tamamlamalarını etkinleştir
zh_hans: 为 MSSQL 启用 Visual Studio IntelliCode 完成功能
zh_hant: 啟用適用於 MSSQL 的 Visual Studio IntelliCode 完成

# setting.suggestSelection.markdown
source: Control whether Visual Studio IntelliCode will modify `editor.suggestSelection` if it is set to a value (`recentlyUsed`) that will result in IntelliCode suggested completion items not being visible.
cs: Řídí, jestli Visual Studio IntelliCode změní nastavení editor.suggestSelection, pokud je nastaveno na hodnotu (`recentlyUsed`), která bude mít za následek to, že se nebudou zobrazovat navrhované položky pro doplňování kódu pomocí IntelliCode.
de: Steuern Sie, ob Visual Studio IntelliCode die Einstellung "editor.suggestSelection" ändert, wenn deren aktuell festgelegter Wert ("recentlyUsed") dazu führt, dass von IntelliCode vorgeschlagene Vervollständigungselemente nicht sichtbar sind.
es: Controla si Visual Studio IntelliCode modificará la configuración de "editor.suggestSelection" cuando está establecida en un valor ("recentlyUsed") que hace que las sugerencias de finalización de IntelliCode no sean visibles.
fr: Permet de contrôler si Visual Studio IntelliCode modifie 'editor.suggestSelection', quand il a une valeur ('recentlyUsed') qui entraîne le masquage des éléments de suggestion de complétion IntelliCode.
hu: Annak szabályozása, hogy Visual Studio IntelliCode módosítja-e az „editor.suggestSelection“ elemet, ha olyan értékre („recentlyUsed“) van beállítva, amely miatt az IntelliCode által javasolt befejezési elemek nem lesznek láthatók.
it: Consente di controllare se Visual Studio IntelliCode modificherà l'impostazione `editor.suggestSelection` se è impostata su un valore (`recentlyUsed`) che impedirà la visualizzazione degli elementi di completamento suggeriti di IntelliCode.
ja: `editor.suggestSelection` が IntelliCode の入力候補項目が表示されないようにする値 (`recentlyUsed`) に設定されている場合、Visual Studio IntelliCode が `editor.suggestSelection` を変更するかどうかを制御します。
ko: IntelliCode에서 제안한 완성 항목이 표시되지 않는 값('recentlyUsed')으로 설정된 경우 Visual Studio IntelliCode가 'editor.suggestSelection'을 수정할지 여부를 제어합니다.
nl: Bepalen of Visual Studio IntelliCode `editor.suggestSelection` zal wijzigen als het is ingesteld op een waarde (`recentlyUsed`) die ertoe leidt dat door IntelliCode voorgestelde voltooiingsitems niet zichtbaar zijn.
pl: Określ, czy funkcja Visual Studio IntelliCode zmodyfikuje ustawienie „editor.suggestSelection”, jeśli jest ono ustawione na wartość („recentlyUsed”), co spowoduje, że sugerowane pozycje uzupełniania nie będą widoczne.
pt_br: Controle se o IntelliCode do Visual Studio modificará `editor.suggestSelection` se estiver definido como um valor (`recentlyUsed`) que fará os itens de conclusão sugeridos pelo IntelliCode não estarem visíveis.
pt_pt: Controle se o Visual Studio IntelliCode modificará "editor.suggestSelection" se estiver definido como um valor (`recentlyUsed`) que fará com que os itens de conclusão sugeridos pelo IntelliCode não sejam visíveis.
ru: Определяет, будет ли Visual Studio IntelliCode изменять параметр "editor.suggestSelection", если для него задано значение ("recentlyUsed"), из-за которого элементы автозавершения IntelliCode не отображаются.
sv: Kontrollera om Visual Studio IntelliCode ändrar editor.suggestSelection om det är inställt på ett värde ("recentlyUsed") som resulterar i att IntelliCode-föreslagna slutförandeobjekt inte visas.
tr: Visual Studio IntelliCode'un, IntelliCode tarafından önerilen tamamlama öğelerinin görünür olmamasıyla sonuçlanacak bir değere (`recentlyUsed`) ayarlandıysa `editor.suggestSelection` değerini değiştirip değiştirmeyeceğini denetleyin.
zh_hans: 控制如果其设置为将导致 IntelliCode 建议的完成项不可见的值(`recentlyUsed`)，Visual Studio IntelliCode 是否将修改 "editor.suggestSelection"。
zh_hant: 控制當 `editor.suggestSelection` 設定為值 (`recentlyUsed`)，而導致看不到 IntelliCode 建議的完成項目時，Visual Studio IntelliCode 是否會修改 `editor.suggestSelection`。

# setting.suggestSelection.enabled
source: Allows IntelliCode to modify the editor.suggestSelection setting on your behalf.
cs: Umožňuje, aby IntelliCode změnil nastavení editor.suggestSelection za vás.
de: Ermöglicht es IntelliCode, die Einstellung "editor.suggestSelection" in Ihrem Namen zu ändern.
es: Permite que IntelliCode modifique la configuración de editor.suggestSelection en su nombre.
fr: Permet à IntelliCode de modifier le paramètre editor.suggestSelection en votre nom.
hu: Engedélyezi az IntelliCode számára, hogy az Ön nevében módosítsa az editor.suggestSelection beállítást.
it: Consente a IntelliCode di modificare l'impostazione editor.suggestSelection per conto dell'utente.
ja: IntelliCode がお客様の代わりに editor.suggestSelection 設定を変更することを許可します。
ko: IntelliCode가 사용자를 대신하여 editor.suggestSelection 설정을 수정할 수 있습니다.
nl: Hiermee kan IntelliCode namens u de instelling editor.suggestSelection wijzigen.
pl: Zezwala funkcji IntelliCode na modyfikowanie ustawienia editor.suggestSelection w Twoim imieniu.
pt_br: Permite que o IntelliCode modifique a configuração editor.suggestSelection no seu nome.
pt_pt: Permite que o IntelliCode modifique a definição editor.suggestSelection em seu nome.
ru: Разрешает IntelliCode изменять параметр editor.suggestSelection от вашего имени.
sv: Tillåter IntelliCode att ändra inställningen editor.suggestSelection å dina vägnar.
tr: IntelliCode'un editor.suggestSelection ayarını sizin adınıza değiştirmesine izin verir.
zh_hans: 允许 IntelliCode 代表你修改 editor.suggestSelection 设置。
zh_hant: 允許 IntelliCode 代表您修改 editor.suggestSelection 設定。

# setting.suggestSelection.disabled
source: You've explicitly opted out of having this configuration controlled by IntelliCode.
cs: Explicitně jste odhlásili řízení této konfigurace pomocí IntelliCode.
de: Sie haben sich ausdrücklich dagegen entschieden, dass diese Konfiguration durch IntelliCode gesteuert wird.
es: Ha decidido explícitamente no permitir que IntelliCode controle esta configuración.
fr: Vous avez explicitement refusé que cette configuration soit contrôlée par IntelliCode.
hu: Kifejezetten elutasította, hogy ezt a konfigurációt az IntelliCode szabályozza.
it: Si è scelto esplicitamente di disattivare il controllo IntelliCode su questa configurazione.
ja: この構成を IntelliCode によって制御しないことが明示的に選択されました。
ko: IntelliCode에서 이 구성을 제어하도록 명시적으로 옵트아웃했습니다.
nl: U hebt zich expliciet afgemeld voor het laten beheren van deze configuratie door IntelliCode.
pl: Dokonano jawnej rezygnacji z kontrolowania tej konfiguracji przez funkcję IntelliCode.
pt_br: Você recusou explicitamente que essa configuração seja controlada pelo IntelliCode.
pt_pt: Optou explicitamente por não ter esta configuração controlada pelo IntelliCode.
ru: Вы явно отказались предоставить IntelliCode управление этой конфигурацией.
sv: Du har uttryckligen avregistrerat dig från att låta den här konfigurationen styras av IntelliCode.
tr: Bu yapılandırmanın IntelliCode tarafından denetlenmesini açıkça geri çevirdiniz.
zh_hans: 你已明确选择不让此配置受 IntelliCode 控制。
zh_hant: 您已明確拒絕讓 IntelliCode 控制此組態。

# setting.suggestSelection.automaticallyOverrodeDefaultValue
source: (DO NOT SET THIS MANUALLY) IntelliCode will set this to record that configuration has been automatically modified to override a default value.
cs: (NENASTAVUJTE RUČNĚ) IntelliCode nastaví tuto položku na záznam, že konfigurace byla automaticky změněna tak, aby přepsala výchozí hodnotu.
de: (NICHT MANUELL FESTLEGEN) IntelliCode legt diese Einstellung fest, um zu kennzeichnen, dass diese Konfiguration automatisch geändert wurde, um einen Standardwert außer Kraft zu setzen.
es: (NO ESTABLECER MANUALMENTE) IntelliCode establecerá esta opción para registrar que la configuración se ha modificado automáticamente para invalidar un valor predeterminado.
fr: (NE PAS DÉFINIR CECI MANUELLEMENT) IntelliCode va définir ce paramètre. Cela permet d'enregistrer le fait que la configuration a été automatiquement modifiée pour remplacer une valeur par défaut.
hu: (NE ÁLLÍTSA BE MANUÁLISAN) Az IntelliCode ezt úgy állítja be, hogy rögzíti, hogy a konfiguráció automatikusan módosult egy alapértelmezett érték felülbírálása érdekében.
it: (NON IMPOSTARE MANUALMENTE) IntelliCode imposterà questa opzione per indicare che la configurazione è stata modificata automaticamente allo scopo di eseguire l'override di un valore predefinito.
ja: (手動で設定しないでください) 既定値をオーバーライドするように構成が自動的に変更されたことを記録するために、IntelliCode がこれを設定します。
ko: (이 설정을 수동으로 설정하지 마세요.) IntelliCode에서 구성이 기본값을 재정의하도록 자동으로 수정되었음을 기록하도록 설정합니다.
nl: (STEL DIT NIET HANDMATIG IN) IntelliCode stelt dit in om vast te leggen dat de configuratie automatisch is gewijzigd om een standaardwaarde te overschrijven.
pl: (NIE USTAWIAJ TEGO RĘCZNIE) Funkcja IntelliCode ustawi tę opcję, aby zarejestrować, że ta konfiguracja została automatycznie zmodyfikowana w celu przesłonięcia wartości domyślnej.
pt_br: (NÃO DEFINA ISSO MANUALMENTE) O IntelliCode definirá isso para registrar que a configuração foi modificada automaticamente para substituir um valor padrão.
pt_pt: (NÃO DEFINIR MANUALMENTE) O IntelliCode irá definir isto para gravar que a configuração foi modificada automaticamente para substituir um valor predefinido.
ru: (Не задавайте вручную!) IntelliCode запишет здесь, что конфигурация была автоматически изменена для переопределения значения по умолчанию.
sv: (ANGE INTE DETTA MANUELLT) IntelliCode anger att konfigurationen automatiskt har ändrats för att åsidosätta ett standardvärde.
tr: (BUNU KENDİNİZ AYARLAMAYIN) IntelliCode bunu, yapılandırmanın varsayılan bir değeri geçersiz kılmak üzere otomatik olarak değiştirildiğini kaydetmek için ayarlar.
zh_hans: (请勿手动设置) IntelliCode 将设置此项来记录已将配置自动修改为替代默认值。
zh_hant: (請勿手動設定此項目) IntelliCode 會設定此項目，來記錄組態已受到自動修改，以覆寫預設值。

# setting.suggestSelection.choseToUpdateConfiguration
source: (DO NOT SET THIS MANUALLY) IntelliCode will set this to record that you've chosen to let IntelliCode change the configuration from a value that was explicitly set.
cs: (NENASTAVUJTE RUČNĚ) IntelliCode nastaví tuto položku na záznam, že jste zvolili možnost, aby IntelliCode změnil konfiguraci z explicitně nastavené hodnoty.
de: (NICHT MANUELL FESTLEGEN) IntelliCode legt diese Einstellung fest, um zu kennzeichnen, dass Sie IntelliCode das Ändern der Konfiguration für einen Wert gestatten, der explizit festgelegt wurde.
es: (NO ESTABLECER MANUALMENTE) IntelliCode establecerá esta opción para registrar que ha elegido dejar que IntelliCode cambie la configuración de un valor que se estableció explícitamente.
fr: (NE PAS DÉFINIR CECI MANUELLEMENT) IntelliCode va définir ce paramètre. Cela permet d'enregistrer le fait que vous avez choisi de laisser IntelliCode changer la configuration à partir d'une valeur définie explicitement.
hu: (NE ÁLLÍTSA BE MANUÁLISAN) Az IntelliCode ezt úgy állítja be, hogy rögzíti, amelyet választott, hogy az IntelliCode módosíthassa a konfigurációt az explicit módon beállított értékről.
it: (NON IMPOSTARE MANUALMENTE) IntelliCode imposterà questa opzione per indicare che si è scelto di consentire a IntelliCode di modificare la configurazione da un valore impostato in modo esplicito.
ja: (手動で設定しないでください) IntelliCode が明示的に設定された値から構成を変更できるようにしたことを記録するように、IntelliCode がこれを設定します。
ko: (이 설정을 수동으로 설정하지 마세요.) IntelliCode에서 IntelliCode가 명시적으로 설정된 값에서 구성을 변경할 수 있도록 선택했음을 기록하도록 설정합니다.
nl: (STEL DIT NIET HANDMATIG IN) IntelliCode zal dit instellen om vast te leggen dat u ervoor hebt gekozen om IntelliCode de configuratie te laten wijzigen van een waarde die expliciet is ingesteld.
pl: (NIE USTAWIAJ TEGO RĘCZNIE) Funkcja IntelliCode ustawi tę opcję, aby zarejestrować, że zostało przez Ciebie wydane zezwolenie, aby funkcja IntelliCode zmieniła konfigurację z jawnie ustawionej wartości.
pt_br: (NÃO DEFINA ISSO MANUALMENTE) O IntelliCode definirá isso para registrar que você escolheu permitir que ele altere a configuração de um valor definido explicitamente.
pt_pt: (NÃO DEFINIR MANUALMENTE) O IntelliCode irá definir isto para registar que escolheu deixar o IntelliCode alterar a configuração de um valor que foi explicitamente definido.
ru: (Не задавайте вручную!) IntelliCode запишет здесь, что вы разрешили IntelliCode изменить в конфигурации явно заданное значение.
sv: (ANGE INTE DETTA MANUELLT) IntelliCode anger detta till att registrera att du har valt att låta IntelliCode ändra konfigurationen från ett värde som uttryckligen har angetts.
tr: (BUNU KENDİNİZ AYARLAMAYIN) IntelliCode bunu, IntelliCode'un yapılandırmayı açıkça ayarlanan bir değerden değiştirmesine izin verdiğinizi kaydetmek için ayarlar.
zh_hans: (请勿手动设置) IntelliCode 将设置此项来记录你已选择指示 IntelliCode 通过明确设置的值更改配置。
zh_hant: (請勿手動設定此項目) IntelliCode 會設定此項目，來記錄您已選擇允許從已明確設定的值變更組態。

# feature.apiExamples.markdown
source: Promotes IntelliCode API Usage Examples extension to vscode intellicode python users.
cs: Propaguje rozšíření Příklady použití rozhraní API IntelliCode u uživatelů vscode intellicode python.
de: Hiermit wird die Erweiterung „IntelliCode-API-Verwendungsbeispiele“ gegenüber vscode-IntelliCode-Python-Benutzern beworben.
es: Promueve la extensión de ejemplos de uso de la API de IntelliCode para los usuarios de Python de IntelliCode.
fr: Promotion de l'extension IntelliCode API Usage Examples auprès des utilisateurs de vscode intellicode python
hu: Előlépteti az IntelliCode API-használati példák bővítményt a Vscode Intellicode Python felhasználói számára.
it: Promuove l'estensione Esempi di utilizzo dell'API IntelliCode per gli utenti Python VSCode IntelliCode.
ja: IntelliCode API Usage Examples 拡張機能を VSCode Intellicode Python ユーザーに昇格させます。
ko: IntelliCode API 사용 예제 확장을 vscode intellicode python 사용자로 승격합니다.
nl: Bevordert de IntelliCode API Usage Examples-extensie voor vscode intellicode python-gebruikers.
pl: Podwyższa poziom rozszerzenia Przykłady użycia interfejsu API funkcji IntelliCode dla użytkowników funkcji IntelliCode w programie Visual Studio Code ze wsparciem języka Python.
pt_br: Promove a extensão Exemplos de Uso da API do IntelliCode para usuários do vscode intellicode python.
pt_pt: Promove a extensão Exemplos de Utilização da API IntelliCode para utilizadores python intellicode.
ru: Повышение уровня расширения с примерами использования API IntelliCode до пользователей Python Intellicode Vscode.
sv: Erbjuder vscode intellicode python-användare tillägget IntelliCode API-användningsexempel.
tr: Vscode intellicode Python kullanıcılarına IntelliCode API Kullanım Örnekleri uzantısını tanıtır.
zh_hans: 将 IntelliCode API 使用示例扩展提升为 vscode intellicode python 用户。
zh_hant: 將 IntelliCode API 使用方式範例延伸模組推廣至 VS Code IntelliCode Python 使用者。
