Repository: FSoft-AI4Code/HyperAgent
Catalog: src/hyperagent/multilspy/language_servers/eclipse_jdtls/static/intellicode/extension/loc/xliff/*/vsintellicode.xlf
Languages: cs, de, es, fr, hu, it, ja, ko, nl, pl, pt_br, pt_pt, ru, sv, tr, zh_hans, zh_hant

# changeIncompatibleSettingsPrompt
source: The configuration 'editor.{0}': '{1}' may cause you to not see IntelliCode completions. Would you like to change it?
cs: Konfigurace editor.{0}: {1} může způsobit, že se vám nebudou doplňovat položky kódu pomocí IntelliCode. Chcete ji změnit?
de: Die Konfiguration "editor.{0}": "{1}" führt möglicherweise dazu, dass IntelliCode-Vervollständigungen nicht angezeigt werden. Möchten Sie die Konfiguration ändern?
es: La configuración "editor. {0}": "{1}" puede hacer que no aparezcan las finalizaciones de IntelliCode. ¿Quiere cambiarla?
fr: La configuration 'editor.{0}' : '{1}' peut vous empêcher de voir les complétions IntelliCode. Voulez-vous la changer ?
hu: A konfiguráció „szerkesztője.{0}“: „{1}“ okozhatja, hogy nem látja az IntelliCode-befejezéseket. Szeretné módosítani?
it: La configurazione 'editor.{0}': '{1}' potrebbe impedire la visualizzazione dei completamenti di IntelliCode. Modificarla?
ja: 構成 'editor.{0}': '{1}' により、IntelliCode 入力候補が表示されない可能性があります。変更しますか?
ko: 구성 'editor.{0}': '{1}'(으)로 인해 IntelliCode 완성이 표시되지 않을 수 있습니다. 변경하시겠습니까?
nl: De configuratie editor.{0}: '{1}' kan ertoe leiden dat u geen IntelliCode-voltooiingen ziet. Wilt u dit wijzigen?
pl: Konfiguracja „editor.{0}”: „{1}” może spowodować, że uzupełnienia funkcji IntelliCode nie będą widoczne. Chcesz ją zmienić?
pt_br: A configuração 'editor.{0}': '{1}' pode fazer com que você não veja as conclusões do IntelliCode. Deseja alterá-la?
pt_pt: A configuração “editor.{0}”: “{1}” pode fazer com que não veja as conclusão do IntelliCode. Quer alterá-lo?
ru: Конфигурация "editor.{0}": "{1}" может привести к тому, что автозавершение IntelliCode перестанет отображаться. Хотите изменить ее?
sv: Konfigurationsredigeraren.{0} : {1} kan leda till att intelliCode slutförs. Vill du ändra det?
tr: 'editor.{0}': '{1}' yapılandırması IntelliCode tamamlamalarını görmemenize neden olabilir. Değiştirmek istiyor musunuz?
zh_hans: 配置 "editor.{0}": "{1}" 可能会导致你看不到 IntelliCode 完成。是否要更改它?
zh_hant: 組態 'editor.{0}': '{1}' 可能會使您看不到 IntelliCode 完成。要予以變更嗎?
